# ComputeRawParameter Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Curve..::..ComputeRawParameter Method
Curve Class See Also
---
Computes the raw parameter from the normalized parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double ComputeRawParameter(
	double normalizedParameter
)
```

Visual Basic
---
```text
Public Function ComputeRawParameter ( _
	normalizedParameter As Double _
) As Double
```

Visual C++
---
```text
public:
double ComputeRawParameter(
	double normalizedParameter
)
```

# ### Parameters
normalizedParameter
    Type: System..::..DoubleThe normalized parameter.
# ### Return Value
The real number equal to the raw curve parameter.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when normalizedParameter is infinite. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the curve is unbound. |

# See Also
Curve Class
Autodesk.Revit.DB Namespace